AFX_GLOBAL_DATA.GetITaskbarList3
Creates and stores in the global data a pointer to ITaskBarList3 interface.
Returns: A pointer to ITaskbarList3 interface if creation creation of a task bar list object succeeds, or NULL if creation fails or current
Operation System is less than Windows 7.

AFX_GLOBAL_DATA.GetITaskbarList
Creates and stores in the global data a pointer to ITaskBarList interface.
Returns: A pointer to ITaskbarList interface if creation of a task bar list object succeeds, or NULL if creation fails or current
Operation System is less than Windows 7.

AFX_GLOBAL_DATA.ShellCreateItemFromParsingName(System.Char!System.Runtime.CompilerServices.IsConst*,IBindCtx*,_GUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Void**)
Creates and initializes a Shell item object from a parsing name.
pszPath: [in] A pointer to a display name.
pbc: A pointer to a bind context that controls the parsing operation.
riid: A reference to an interface ID.
ppv: [out] When this function returns, contains the interface pointer requested in riid. This will typically be IShellItem or IShellItem2.
Returns: Returns S_OK if successful, or an error value otherwise.

AFX_GLOBAL_DATA.GetShellAutohideBars
Determines positions of Shell auto hide bars.
Returns:  An integer value with encoded flags that specify positions of auto hide bars.
It may combine the following values: AFX_AUTOHIDE_BOTTOM, AFX_AUTOHIDE_TOP, AFX_AUTOHIDE_LEFT,
AFX_AUTOHIDE_RIGHT.

AFX_GLOBAL_DATA.bIsWindows7
Indicates whether the application is being executed under Windows 7 OS or higher

AFX_GLOBAL_DATA.clrInactiveCaptionGradient
Specifies gradient color of inactive active caption. Generally used for docking panes.

AFX_GLOBAL_DATA.clrActiveCaptionGradient
Specifies gradient color of active caption. Generally used for docking panes.